tutorials/incompressible/pimpleFoam/pitzDaily/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    energySource
    {
        type            vectorCodedSource;

        //active          yes;

        name            sourceTime;


        vectorCodedSourceCoeffs
        {
            selectionMode   all;    //cellSet;
            //cellSet 
            fields          (U);


            codeInclude
            #{

            #};

            codeCorrect
            #{
                Pout<< "**codeCorrect**" << endl;
            #};

            codeAddSup
            #{
                Pout<< "**codeAddSup**" << endl;
                const Time& time = mesh().time();
                const scalarField& V = mesh_.V();
                Pout<< "cells:" << cells() << endl;

                vectorField& heSource = eqn.source();
                heSource -= sqr(time.value())*vector::one*V;
            #};

            codeSetValue
            #{
                Pout<< "**codeSetValue**" << endl;
            #};

            // Dummy entry. Make dependent on above to trigger recompilation
            code
            #{
                $codeInclude
                $codeCorrect
                $codeAddSup
                $codeSetValue
            #};
        }

        sourceTimeCoeffs
        {
            $vectorCodedSourceCoeffs;
        }
    }


// ************************************************************************* //
